<?php

return [
    // layouts.header
    'seaq_name' => 'رابطة المهندسين السودانيين بدولة قطر',
    'home' => 'الرئيسة',
    'programs&events' => 'البرامج والفعاليات',
    'join_us' => 'انضم إلينا',
    'career_development' => 'التطوير المهني',
    'about' => 'من نحن؟',
    'about_seaq' => 'عن الرابطة',
    'newsletter' => 'مجلة الرابطة',
    'profile' => 'الملف التعريفي',
    
    // layouts.app
    'tab_title' => 'رابطة المهندسين',

    // layouts.footer
    'our_site' => 'موقعنا',
    'contact_us' => 'تواصل معنا',
    'location_address' => 'الدوحة - 7CCP+V98',
    'logo_alt' => 'شعار',
    'developed_by' => 'تطوير:',
    'for_software' => 'للبرمجيات',
    'all_rights_reserved' => 'كل الحقوق محفوظة.',

    // home
    'home_tab_title' => 'الرئيسة',
    'recent_news' => 'آخر الأخبار',
    'read_more' => 'اقرأ المزيد ←',

    'our_vision' => 'رؤيتنا',
    'vision_body' => 'كيان مهني احترافي يستشرف المستقبل ويستنهض الطاقات ويستثمر الجهود العلمية والتطبيقية الهندسية المميزة في الارتقاء بحياة الإنسان والمجتمعات.',

    'our_mission' => 'رسالتنا',
    'mission_body' => 'جمعية مهنية ذات نفع عام، تهدف للارتقاء بالكفاءة المهنية والقدرات الفنية والمكانة العلمية للمهندس والفني والتقني السوداني وتعزيز دوره في ريادة النهضة وبناء حياة أفضل من خلال تشجيع الابتكار، وتطوير الذات، وتبادل المعرفة والخبرات والالتزام بأخلاق المهنة.',

    'objectives' => 'أهدافنا',
    'objectives_body' => '<ol style="list-style:decimal;">
    <li>رفع كفاءة المهندسين والفنيين والتقنيين السودانيين المقيمين بدولة قطر.</li>
    <li>تعزيز الصورة الذهنية الإيجابية للكفاءة المهنية للمهندس والفني والتقني السوداني بدولة قطر.</li>
    <li>إزالة العقبات وتعزيز مكانة واستمرارية مساهمة المهندس والفني والتقني السوداني في سوق العمل.</li>
    <li>الحفاظ على حقوق ومكتسبات المهندس والفني والتقني السوداني.</li>
    <li>توفير تسهيلات وخدمات متميزة للأعضاء الفاعلين وفقاً لما يحدده النظام الأساسي للرابطة.</li>
    <li>تعزيز وتنمية أواصر العلاقات بين الأعضاء وتنشيط التواصل والتفاعل الاجتماعي لأعضاء الرابطة.</li>
    </ol>',
    
    'objective_1' => 'رفع كفاءة المهندسين والفنيين والتقنيين السودانيين المقيمين بدولة قطر.',

    'objective_2' => 'تعزيز الصورة الذهنية الإيجابية للكفاءة المهنية للمهندس والفني والتقني السوداني بدولة قطر.',

    'objective_3' => 'إزالة العقبات وتعزيز مكانة واستمرارية مساهمة المهندس والفني والتقني السوداني في سوق العمل.',

    'objective_4' => 'الحفاظ على حقوق ومكتسبات المهندس والفني والتقني السوداني.',

    'objective_5' => 'توفير تسهيلات وخدمات متميزة للأعضاء الفاعلين وفقاً لما يحدده النظام الأساسي للرابطة.',

    'objective_6' => 'تعزيز وتنمية أواصر العلاقات بين الأعضاء وتنشيط التواصل والتفاعل الاجتماعي لأعضاء الرابطة.',


    // events
    'events_tab_title' => 'البرامج والفعاليات',
    'google_map' => 'خرائط جوجل',

    // join
    'join_tab_title' => 'انضم للرابطة',
    'join_the_association' => 'انضم إلى الرابطة',
    'fill_membership_form' => 'ملء نموذج العضوية',
    'join_body' => 'كن عضوا في رابطة المهندسين السودانيين بقطر',

    // career
    'download' => 'تنزيل',

    // about
    'about_tab_title' => 'من نحن؟',

    // newsletter and profile
    'newsletter_seaq' => 'مجلة رابطة المهندسين السودانيين بقطر',
    'profile_seaq' => 'ملف الرابطة التعريفي',
    'download_pdf' => 'تـنزيـل pdf',
    'notification_for_tabs_and_phones' => 'عرض ملفات ال pdf غير مدعوم في الهواتف والأجهزة اللوحية.<br> نزِّل الملف واستعرضه بكل سهولة!',

    // ------------------------------------------
    // admin:

    'save' => 'حفظ',
    'cancel' => 'إلغاء',
    'edit' => 'تعديل',
    'delete' => 'حذف',

    // auth.login
    'login_title' => 'تسجيل الدخول',
    'system_admininstration' => 'إدارة النظام',
    'email' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'login_button' => 'دخول',

    //dashboard
    'dashboard' => 'لوح التحكم',
    'posts' => 'المنشورات',
    'events' => 'الفعاليات',
    'about_us_page' => 'صفحة من نحن؟',

    'profile_file' => 'ملف البروفايل',
    'newsletter_file' => 'مجلة الرابطة',
    'current_file' => 'الملف الحالي',

    'change_pw' => 'تغيير كلمة المرور',
    'current_pw' => 'كلمة المرور الحالية',
    'new_pw' => 'كلمة المرور الجديدة',
    'confirm' => 'تأكيد',

    //posts.index
    'posts_management' => 'إدارة المنشورات',
    'new_post' => 'منشور جديد',
    'id' => 'المعرّف',
    'title' => 'العنوان',
    'post_image' => 'صورة المنشور',
    'display' => 'العرض',
    'shown' => 'معروض',
    'hidden' => 'مخفى',
    'confirm_delete_post' => 'أترغب في حذف هذا المنشور؟',
    'no_posts' => 'ما من منشور ليُعرض.',
    'order_at_home' => 'ترتيب العرض في الرئيسة',
    'updated_at' => 'آخر تعديل',
    'created_at' => 'وقت الإنشاء',
    'actions' => 'إجراءات',
    'no_image' => 'لا صورة',

    //events.index
    'events_management' => 'إدارة الفعاليات',
    'new_event' => 'فعالية جديدة',
    'event_image' => 'صورة الفعالية',
    'datetime' => 'الوقت والتاريخ',
    'shown_f' => 'معروضة',
    'hidden_f' => 'مخفاة',
    'confirm_delete_event' => 'أترغب في حذف هذه الفعالية؟',
    'no_events' => 'ما من فعالية لتُعرض.',

    //posts.create
    'new_post' => 'إنشاء منشور جديد',
    'add' => 'إضافة',

    //events.create
    'new_event' => 'إنشاء فعالية جديدة',

    //posts.edit
    'edit_post' => 'تعديل منشور',

    //events.edit
    'edit_event' => 'تعديل فعالية',

    //posts._form , events._form
    'title' => 'العنوان',
    'title_en' => 'العنوان (EN)',
    'image' => 'الصورة',
    'image_note' => 'إن لم ترغب في :action الصورة فاترك حقل الصورة فارغاً.',
    'body' => 'المحتوى',
    'body_en' => 'المحتوى (EN)',
    'show_on_homepage' => 'عرض في الصفحة الرئيسية',
    'order_at_homepage' => 'الترتيب في الصفحة الرئيسية',
    'remove_post_image' => 'أترغب في إزالة صورة هذا المنشور؟',

    'description' => 'الوصف',
    'description_en' => 'الوصف (EN)',
    'location' => 'الموقع',
    'location_en' => 'الموقع (EN)',
    'location_url' => 'رابط الموقع',
    'date' => 'التاريخ',
    'time' => 'الوقت',
    'show_event' => 'عرض في صفحة الفعاليات',
    'remove_event_image' => 'أترغب في إزالة صورة هذه الفعالية؟',

    //aboutusEdit
    'aboutus_tab_title' => 'تحرير (من نحن؟)',
    'aboutus_page_content' => 'محتوى صفحة (من نحن؟)',
    'content' => 'المحتوى',
    'content_en' => 'المحتوى (EN)',
    // ------------------------------------------

];
